# coding: utf-8
#

print("Hello, ruby.\n")       # printメソッドで出力
print('Hello, ruby.\n')       # ''は変数や特殊文字などの展開をしない。
print("\n")
print "Hello!", "Ruby!\n"     # ()省略可能, ","で複数の文字列出力

puts("HELLO, RUBY.")          # printと比べて自動改行

print("あいうえお\n")

puts("--------------------------------------------------------------------------")
# "p" オブジェクトの内容表示に使用する\n"
p "abc" # "abc"
p 100   # 100
p "100" # "100"
p "アイウエオ" # "アイウエオ"
# 文字化けする場合、実行時に "ruby -E UTF-8 01_sample.rb"

puts("--------------------------------------------------------------------------")
print(100, "\n")                # Fixnum(整数) Object
print(3.14, "\n")               # Float(倍精度浮動小数点数なのでむしろdouble) Object

puts("--------------------------------------------------------------------------")
# 普通に四則演算を使える
# +,-,*,/,%(剰余)
puts(1+1)
puts(3-4)
puts(5*6)
puts(7/8)     # これは整数で割り算されているのか "0"
puts(7.0/8.0) # これは不動小数点で計算。"0.875"
puts(9%2)     # 余りの１が返る

puts("--------------------------------------------------------------------------")
# 数学関数(Math)
puts(Math.sin(90))
puts(Math.cos(45))
puts(Math.sqrt(100))

puts("--------------------------------------------------------------------------")
# 変数割り当て
var01 = "abcdefg"
print("var01=", var01, "\n")
print("var01=#{var01}\n")       # ""中に変数を展開したい場合、#{}
var02 = 1234
print("var02=", var02, "\n")
var03 = "ABC\nEFG"
print("var03=", var03, "\n")

puts("--------------------------------------------------------------------------")
# 定数: 定数を使いたい場合、大文字始まりで宣言する
#  (本にはまだ書いてないことなので、いずれまた)
Const01 = "abc"
print("Const01=", Const01, "\n")

puts("--------------------------------------------------------------------------")
# Comment sample

=begin

Comment sample

=end

puts("--------------------------------------------------------------------------")
# 条件分岐命令

if 1 then
  puts("if test.(true)")
else
  puts("if test.(false)")
end

# 比較演算子
# "==", "<=", ">=", "!=", "<", ">"
if 1 != 1 # thenは省略可能
  puts("if 1!=1 test.(true)")
else
  puts("if 1!=1 test.(false)")
end

if 0 then
  puts("if elsif test.(ture)")
elsif 1 then
  puts("if elsif test.(false)")
end

puts("--------------------------------------------------------------------------")
# 繰り返し
i=0
while i < 10 do                 # doは省略可能
  print("i=", i, "\n")
  i += 1
end
# i++, ++iなどはサポートしてないぽい...

# 回数が決まっているならかける方法 "X.times do ... end"
# ここのtimesをイテレータ(繰り返すもの)と呼ぶ。他にeachというイテレータも存在する。
i=3
i.times do
  printf("3.times\n")
end

puts("--------------------------------------------------------------------------")
puts("end")
